#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/cicd-series/heroku-prod/runs/run-eZnjQG6qWMX7ZCYk[0m
[0m
Waiting for the plan to start...

Terraform v0.12.26
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/25 00:59:37 [DEBUG] Using modified User-Agent: Terraform/0.12.26 TFC/133917c07a
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # heroku_app.guestbook_app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "heroku_app" "guestbook_app" {
      [32m+[0m [0m[1m[0macm[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mall_config_vars[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0mbuildpacks[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mconfig_vars[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mgit_url[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mheroku_hostname[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0minternal_routing[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "cicd-series-guestbook"
      [32m+[0m [0m[1m[0mregion[0m[0m                = "us"
      [32m+[0m [0m[1m[0msensitive_config_vars[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0mstack[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0muuid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mweb_url[0m[0m               = (known after apply)
    }

[1m  # heroku_build.guestbook_build[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "heroku_build" "guestbook_build" {
      [32m+[0m [0m[1m[0mapp[0m[0m               = "cicd-series-guestbook"
      [32m+[0m [0m[1m[0mbuildpacks[0m[0m        = [
          [32m+[0m [0m"https://github.com/heroku/heroku-buildpack-scala",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mlocal_checksum[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0moutput_stream_url[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrelease_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mslug_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m            = {
          [32m+[0m [0m"url" = "https://github.com/DWiechert/cicd-series/archive/0.0.1.tar.gz"
        }
      [32m+[0m [0m[1m[0mstack[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0muser[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0muuid[0m[0m              = (known after apply)
    }

[1m  # heroku_formation.guestbook_formation[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "heroku_formation" "guestbook_formation" {
      [32m+[0m [0m[1m[0mapp[0m[0m      = "cicd-series-guestbook"
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mquantity[0m[0m = 1
      [32m+[0m [0m[1m[0msize[0m[0m     = "Free"
      [32m+[0m [0m[1m[0mtype[0m[0m     = "web"
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.[0m
```

</details>

*Pusher: @DWiechert, Action: `pull_request`, Working Directory: ``, Workflow: `Test CI`*